In [6]:
#import necessary libraries
import pandas as pd
import sqlite3

In [7]:
#create SQL table
create_table="""CREATE TABLE student_score (Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);"""

In [8]:
#execute the SQL statement - In memory database
executeSQL=sqlite3.connect(":memory:")
executeSQL.execute(create_table)
executeSQL.commit()

In [10]:
#prepare a SQL query
SQL_query=executeSQL.execute('select * from student_score')

In [11]:
#fetch result from the sqllite database
resultset=SQL_query.fetchall()

In [12]:
#view result(empty data)
resultset

[]

In [13]:
#prepare data to insert data into the table
insertSQL=[(10,'Jack',85,92),
           (29,'Tom',73,89),
           (65,'Ram',65.5,77),
           (5,'Steve',55,91)]

In [14]:
insert_statement="insert into student_score values (?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [17]:
#fetch result from the sqllite database
SQL_query=executeSQL.execute('select * from student_score')
resultset=SQL_query.fetchall()

In [18]:
#view result
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [31]:
#put the records togther in a dataframe
field_names = [i[0] for i in SQL_query.description]
#df_student_records=pd.DataFrame(resultset,columns=zip(*SQL_query.description)[0])
df_student_records=pd.DataFrame(resultset,columns=field_names)

In [32]:
#view dataframe
df_student_records

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0